Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Create a curve that blends between two curves
curve1:  First curve to blend
curve2:  Second curve to blend
endOrStart1:  flag to indicate which end of curve1 to blend
endOrStart2:  flag to indicate which end of curve1 to blend
isG2Continuous:  flag to indicate if resultant curve is of G1 continuity or G2 continuity
Returns:  Resulting curve from blending two curves
blend,make continuous,connect