Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Looks up a localized string similar to Your inputs lie outside of the allowable modeling range, consider choosing the {0} setting with a modeling range between {1} and {2} from the Dynamo => Preferences dialog, Geometry Scaling section under General tab.

Autodesk.DesignScript.Geometry.Properties.Resources.tsplinessurface_creatchmatch_deprecated2
Looks up a localized string similar to .