Dynamo.Properties.Resources.AutocompleteNoRecommendationsMessage
Looks up a localized string similar to There are no recommendations yet. You can try switching to object type autocomplete..

Dynamo.Properties.Resources.LoginNeededMessage
Looks up a localized string similar to You need to login to your account to get recommendations. Please log in or switch to object type autocomplete..