Autodesk.DesignScript.Interfaces.IInstancingRenderPackage.AddInstanceMatrix(System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Single,System.Guid)
Set the transform using a series of floats. The resulting transform is applied to the range of geometry specified by the id.
Following conventional matrix notation, m11 is the value of the first row and first column, and m12
is the value of the first row and second column.
NOTE: This method should set the matrix exactly as described by the caller.
m11:
m12:
m13:
m14:
m21:
m22:
m23:
m24:
m31:
m32:
m33:
m34:
m41:
m42:
m43:
m44:

Autodesk.DesignScript.Interfaces.IInstancingRenderPackage.AddInstanceMatrix(System.Single[],System.Guid)
Set the transform as a float array, The resulting transform is applied to the range of geometry specified by the id.
This matrix should be laid out as follows in row vector order:
[Xx,Xy,Xz, 0,
Yx, Yy, Yz, 0,
Zx, Zy, Zz, 0,
offsetX, offsetY, offsetZ, W]
NOTE: This method should transform the matrix from row vector order to whatever form is needed by the implementation.
When converting from ProtoGeometry CoordinateSystem form to input matrix, set the first row to the X axis of the CS,
the second row to the Y axis of the CS, the third row to the Z axis of the CS, and the last row to the CS origin, where W = 1.
matrix: