Dynamo.Logging.Analytics.DisableAnalytics
Disables all analytics collection (Google, ADP, etc.) for the lifetime of the process.
To ensure that no analytics get through, please set set this flag to false before the DynamoModel is constructed.