Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindAllVariables(System.String)
Find a variable assignment of the form "varName = bla" where bla is matched by
the given regex
code: The code to search
valueRegex: Your regex to match the type
Returns: A dictionary of name to assignment line pairs