Dynamo.PythonServices.PythonEngine.EvaluationStarted
Add an event handler before the Python evaluation begins
callback:

Dynamo.PythonServices.PythonEngine.EvaluationFinished
Add an event handler after the Python evaluation has finished
callback: